package ru.isaev.lesson25.task1;

public class MapFilter {
    /*
    25_ДЗ_1_Фильтр мапы
public boolean isUnique(Map<String, String> map);

Написать метод, который возвращает true, если в мапе нет двух и более одинаковых
value, и false в противном случае.

Для пустой мапы метод возвращает true.

Например, для метода {Вася=Иванов, Петр=Петров, Виктор=Сидоров, Сергей=Савельев,
Вадим=Викторов} метод вернет true,

а для {Вася=Иванов, Петр=Петров, Виктор=Иванов, Сергей=Савельев, Вадим=Петров}
метод вернет false.
     */
}
