package ru.isaev.lesson31;

public class Palindrome {
    /*
    ДЗ 31
    Палиндром - это слово, фраза, число или другая последовательность символов или элементов, которая читает то же самое вперед или назад.

            Например: 12121 - палиндром, так как он читает то же самое вперед или назад. мадам тоже палиндром.

    Требуется написать 2 реализации проверки строки на палиндром:

        1.Перемещение с обоих концов строки одновременно

        2.Используя стандартные функции строки
    */
}
